{
  "generated": "2026-07-12",
  "note": "Generated by scripts/check-vocab.ts --sync. Do not edit by hand. Lists the local names each externally-governed vocabulary defines, used by the vocab guard.",
  "vocabs": {
    "gs1": {
      "namespace": "https://ref.gs1.org/voc/",
      "source": "https://ref.gs1.org/voc/data/gs1Voc.ttl",
      "termCount": 2532,
      "terms": [
        "AI",
        "ALARM_CONDITION",
        "AbsoluteHumidity",
        "AbsorbedDose",
        "AbsorbedDoseRate",
        "Acceleration",
        "AdditionalProductClassificationDetails",
        "AdditiveDetails",
        "AllergenDetails",
        "AllergenTypeCode",
        "AllergenTypeCode-1-NAPHTHOL",
        "AllergenTypeCode-2-HYDROXYETHYL-PICRAMIC_ACID",
        "AllergenTypeCode-2-METHYL-5-HYDROXYETHYLAMINOPHENOL",
        "AllergenTypeCode-3-AMINOPHENOL",
        "AllergenTypeCode-4-AMINO-3-NITROPHENOL",
        "AllergenTypeCode-4-HYDROXY-PROPYLAMINO-3-NITROPHENOL",
        "AllergenTypeCode-AA",
        "AllergenTypeCode-ABALONE",
        "AllergenTypeCode-ABD",
        "AllergenTypeCode-ABE",
        "AllergenTypeCode-ABF",
        "AllergenTypeCode-ABG",
        "AllergenTypeCode-ABH",
        "AllergenTypeCode-ABI",
        "AllergenTypeCode-ABJ",
        "AllergenTypeCode-ABK",
        "AllergenTypeCode-ABL",
        "AllergenTypeCode-ABN",
        "AllergenTypeCode-AC",
        "AllergenTypeCode-ACP",
        "AllergenTypeCode-AD",
        "AllergenTypeCode-ADB",
        "AllergenTypeCode-ADC",
        "AllergenTypeCode-ADE",
        "AllergenTypeCode-ADF",
        "AllergenTypeCode-ADG",
        "AllergenTypeCode-ADH",
        "AllergenTypeCode-ADI",
        "AllergenTypeCode-ADJ",
        "AllergenTypeCode-ADK",
        "AllergenTypeCode-ADL",
        "AllergenTypeCode-ADM",
        "AllergenTypeCode-ADP",
        "AllergenTypeCode-ADQ",
        "AllergenTypeCode-ADR",
        "AllergenTypeCode-ADS",
        "AllergenTypeCode-ADT",
        "AllergenTypeCode-ADU",
        "AllergenTypeCode-ADV",
        "AllergenTypeCode-ADW",
        "AllergenTypeCode-AE",
        "AllergenTypeCode-AF",
        "AllergenTypeCode-AH",
        "AllergenTypeCode-AI",
        "AllergenTypeCode-AJF",
        "AllergenTypeCode-AL",
        "AllergenTypeCode-ALMONDS",
        "AllergenTypeCode-ALPHA_ISOMETHYL_IONONE",
        "AllergenTypeCode-AM",
        "AllergenTypeCode-AMYLCINNAMYL_ALCOHOL",
        "AllergenTypeCode-AMYL_CINNAMAL",
        "AllergenTypeCode-AN",
        "AllergenTypeCode-ANCHOVY",
        "AllergenTypeCode-ANISE_ALCOHOL",
        "AllergenTypeCode-ANO",
        "AllergenTypeCode-AP",
        "AllergenTypeCode-APL",
        "AllergenTypeCode-AS",
        "AllergenTypeCode-ASD",
        "AllergenTypeCode-AU",
        "AllergenTypeCode-AW",
        "AllergenTypeCode-AWF",
        "AllergenTypeCode-AY",
        "AllergenTypeCode-BA",
        "AllergenTypeCode-BARLEY",
        "AllergenTypeCode-BARNACLE",
        "AllergenTypeCode-BAS",
        "AllergenTypeCode-BASA",
        "AllergenTypeCode-BASS",
        "AllergenTypeCode-BB",
        "AllergenTypeCode-BC",
        "AllergenTypeCode-BE",
        "AllergenTypeCode-BEECH_NUTS",
        "AllergenTypeCode-BEEF",
        "AllergenTypeCode-BENZYL_ALCOHOL",
        "AllergenTypeCode-BENZYL_BENZOATE",
        "AllergenTypeCode-BENZYL_CINNAMATE",
        "AllergenTypeCode-BENZYL_SALICYLATE",
        "AllergenTypeCode-BF",
        "AllergenTypeCode-BFD",
        "AllergenTypeCode-BFH",
        "AllergenTypeCode-BI",
        "AllergenTypeCode-BLF",
        "AllergenTypeCode-BLUEFISH",
        "AllergenTypeCode-BM",
        "AllergenTypeCode-BN",
        "AllergenTypeCode-BND",
        "AllergenTypeCode-BO",
        "AllergenTypeCode-BP",
        "AllergenTypeCode-BQ",
        "AllergenTypeCode-BR",
        "AllergenTypeCode-BRAZIL_NUTS",
        "AllergenTypeCode-BRC",
        "AllergenTypeCode-BREAM",
        "AllergenTypeCode-BRM",
        "AllergenTypeCode-BS",
        "AllergenTypeCode-BUTTERNUTS",
        "AllergenTypeCode-BUTYLPHENYL_METHYLPROPIONATE",
        "AllergenTypeCode-BWD",
        "AllergenTypeCode-CA",
        "AllergenTypeCode-CARP",
        "AllergenTypeCode-CARROTS",
        "AllergenTypeCode-CASHEW_NUTS",
        "AllergenTypeCode-CATFISH",
        "AllergenTypeCode-CELERY",
        "AllergenTypeCode-CEREALS_CONTAINING_GLUTEN",
        "AllergenTypeCode-CFD",
        "AllergenTypeCode-CFH",
        "AllergenTypeCode-CHAR",
        "AllergenTypeCode-CHB",
        "AllergenTypeCode-CHESTNUTS",
        "AllergenTypeCode-CHICKEN_MEAT",
        "AllergenTypeCode-CHINQUAPINS",
        "AllergenTypeCode-CHR",
        "AllergenTypeCode-CHUB",
        "AllergenTypeCode-CINNAMAL",
        "AllergenTypeCode-CINNAMYL_ALCOHOL",
        "AllergenTypeCode-CISCO",
        "AllergenTypeCode-CITRAL",
        "AllergenTypeCode-CITRONELLOL",
        "AllergenTypeCode-CKF",
        "AllergenTypeCode-CL",
        "AllergenTypeCode-CLAM",
        "AllergenTypeCode-CLM",
        "AllergenTypeCode-CM",
        "AllergenTypeCode-CN",
        "AllergenTypeCode-CO",
        "AllergenTypeCode-COCKLE",
        "AllergenTypeCode-COCOA",
        "AllergenTypeCode-COCONUTS",
        "AllergenTypeCode-COD",
        "AllergenTypeCode-COK",
        "AllergenTypeCode-CON",
        "AllergenTypeCode-CONCH",
        "AllergenTypeCode-CORIANDER",
        "AllergenTypeCode-CORN",
        "AllergenTypeCode-COTTON_SEEDS",
        "AllergenTypeCode-COUMARIN",
        "AllergenTypeCode-CRAB",
        "AllergenTypeCode-CRAWFISH",
        "AllergenTypeCode-CRUSTACEANS",
        "AllergenTypeCode-CS",
        "AllergenTypeCode-CSC",
        "AllergenTypeCode-CT",
        "AllergenTypeCode-D-LIMONENE",
        "AllergenTypeCode-DA",
        "AllergenTypeCode-DIAMINOPHENOLS",
        "AllergenTypeCode-DMF",
        "AllergenTypeCode-DP",
        "AllergenTypeCode-DYF",
        "AllergenTypeCode-EEL",
        "AllergenTypeCode-EG",
        "AllergenTypeCode-EGGS",
        "AllergenTypeCode-EOD",
        "AllergenTypeCode-EP",
        "AllergenTypeCode-EUGENOL",
        "AllergenTypeCode-EV",
        "AllergenTypeCode-EVERNIA_FURFURACEA",
        "AllergenTypeCode-EVERNIA_PRUNASTRI",
        "AllergenTypeCode-FA",
        "AllergenTypeCode-FARNESOL",
        "AllergenTypeCode-FH",
        "AllergenTypeCode-FISH",
        "AllergenTypeCode-FLOUNDER",
        "AllergenTypeCode-FT",
        "AllergenTypeCode-GB",
        "AllergenTypeCode-GE",
        "AllergenTypeCode-GERANIOL",
        "AllergenTypeCode-GINKGO_NUTS",
        "AllergenTypeCode-GK",
        "AllergenTypeCode-GL",
        "AllergenTypeCode-GLUTAMATE",
        "AllergenTypeCode-GLUTEN",
        "AllergenTypeCode-GO",
        "AllergenTypeCode-GOM",
        "AllergenTypeCode-GROUPER",
        "AllergenTypeCode-GS",
        "AllergenTypeCode-GTD",
        "AllergenTypeCode-HADDOCK",
        "AllergenTypeCode-HAKE",
        "AllergenTypeCode-HALIBUT",
        "AllergenTypeCode-HAZELNUTS",
        "AllergenTypeCode-HB",
        "AllergenTypeCode-HC",
        "AllergenTypeCode-HC_BLUE_NO_11",
        "AllergenTypeCode-HC_BLUE_NO_12",
        "AllergenTypeCode-HD",
        "AllergenTypeCode-HE",
        "AllergenTypeCode-HERRING",
        "AllergenTypeCode-HEXYL_CINNAMAL",
        "AllergenTypeCode-HH",
        "AllergenTypeCode-HICKORY_NUTS",
        "AllergenTypeCode-HN",
        "AllergenTypeCode-HP",
        "AllergenTypeCode-HX",
        "AllergenTypeCode-HY",
        "AllergenTypeCode-HYDROXYBENZOMORPHOLINE",
        "AllergenTypeCode-HYDROXYCITRONELLAL",
        "AllergenTypeCode-HYDROXYETHYL-2-NITRO-P-TOLUIDINE",
        "AllergenTypeCode-HYDROXYISOHEXYL_3-CYCLOHEXENE_CARBOXALDEHYDE_ISOEUGENOL_LIMONENE_LINAL",
        "AllergenTypeCode-ISOEUGENOL",
        "AllergenTypeCode-JCH",
        "AllergenTypeCode-JFD",
        "AllergenTypeCode-KAMUT",
        "AllergenTypeCode-KRILL",
        "AllergenTypeCode-KWD",
        "AllergenTypeCode-LACTOSE",
        "AllergenTypeCode-LAND",
        "AllergenTypeCode-LGD",
        "AllergenTypeCode-LICHEE_NUTS",
        "AllergenTypeCode-LIMPETS",
        "AllergenTypeCode-LINALOOL",
        "AllergenTypeCode-LMT",
        "AllergenTypeCode-LOBSTER",
        "AllergenTypeCode-LSN",
        "AllergenTypeCode-LUPINE",
        "AllergenTypeCode-LX",
        "AllergenTypeCode-MAC",
        "AllergenTypeCode-MACADAMIA_NUTS",
        "AllergenTypeCode-MACKEREL",
        "AllergenTypeCode-MAHI_MAHI",
        "AllergenTypeCode-MAL",
        "AllergenTypeCode-MARLIN",
        "AllergenTypeCode-MELATONIN",
        "AllergenTypeCode-METHYL_2_OCTYNOATE",
        "AllergenTypeCode-METHYL_HEPTIN_CARBONATE",
        "AllergenTypeCode-MFD",
        "AllergenTypeCode-MH",
        "AllergenTypeCode-MILK",
        "AllergenTypeCode-MKF",
        "AllergenTypeCode-ML",
        "AllergenTypeCode-MM",
        "AllergenTypeCode-MMD",
        "AllergenTypeCode-MOD",
        "AllergenTypeCode-MOLLUSCS",
        "AllergenTypeCode-MSS",
        "AllergenTypeCode-MUSSELS",
        "AllergenTypeCode-MUSTARD",
        "AllergenTypeCode-NC",
        "AllergenTypeCode-NE",
        "AllergenTypeCode-NK",
        "AllergenTypeCode-NL",
        "AllergenTypeCode-NM",
        "AllergenTypeCode-NO_DECLARED_ALLERGENS",
        "AllergenTypeCode-NP",
        "AllergenTypeCode-NR",
        "AllergenTypeCode-NW",
        "AllergenTypeCode-OAT",
        "AllergenTypeCode-OCT",
        "AllergenTypeCode-OCTOPUS",
        "AllergenTypeCode-OFD",
        "AllergenTypeCode-OGD",
        "AllergenTypeCode-ON",
        "AllergenTypeCode-ORANGE_ROUGHY",
        "AllergenTypeCode-ORR",
        "AllergenTypeCode-OYS",
        "AllergenTypeCode-OYSTERS",
        "AllergenTypeCode-P-METHYLAMINOPHENOL",
        "AllergenTypeCode-P-PHENYLENEDIAMINE",
        "AllergenTypeCode-PEANUTS",
        "AllergenTypeCode-PEAS",
        "AllergenTypeCode-PECAN_NUTS",
        "AllergenTypeCode-PER",
        "AllergenTypeCode-PERCH",
        "AllergenTypeCode-PERIWINKLE",
        "AllergenTypeCode-PFD",
        "AllergenTypeCode-PGT",
        "AllergenTypeCode-PHD",
        "AllergenTypeCode-PIKE",
        "AllergenTypeCode-PILI_NUTS",
        "AllergenTypeCode-PINE_NUTS",
        "AllergenTypeCode-PISTACHIOS",
        "AllergenTypeCode-PLAICE",
        "AllergenTypeCode-PLC",
        "AllergenTypeCode-PM",
        "AllergenTypeCode-PN",
        "AllergenTypeCode-PO",
        "AllergenTypeCode-POD_FRUITS",
        "AllergenTypeCode-POLLOCK",
        "AllergenTypeCode-POM",
        "AllergenTypeCode-POMPANO",
        "AllergenTypeCode-POPPY_SEEDS",
        "AllergenTypeCode-PORGY",
        "AllergenTypeCode-PORK",
        "AllergenTypeCode-PP",
        "AllergenTypeCode-PRAWNS",
        "AllergenTypeCode-PRG",
        "AllergenTypeCode-PS",
        "AllergenTypeCode-PULSES",
        "AllergenTypeCode-QUA",
        "AllergenTypeCode-QUAHAUGS",
        "AllergenTypeCode-QUEENSLAND_NUTS",
        "AllergenTypeCode-ROCKFISH",
        "AllergenTypeCode-ROF",
        "AllergenTypeCode-RYE",
        "AllergenTypeCode-SA",
        "AllergenTypeCode-SAD",
        "AllergenTypeCode-SALICYLATE",
        "AllergenTypeCode-SALMON",
        "AllergenTypeCode-SAR",
        "AllergenTypeCode-SARDINE",
        "AllergenTypeCode-SB",
        "AllergenTypeCode-SC",
        "AllergenTypeCode-SCA",
        "AllergenTypeCode-SCALLOPS",
        "AllergenTypeCode-SD",
        "AllergenTypeCode-SDF",
        "AllergenTypeCode-SE",
        "AllergenTypeCode-SEED_PRODUCTS",
        "AllergenTypeCode-SESAME_SEEDS",
        "AllergenTypeCode-SF",
        "AllergenTypeCode-SFD",
        "AllergenTypeCode-SFT",
        "AllergenTypeCode-SG",
        "AllergenTypeCode-SH",
        "AllergenTypeCode-SHARK",
        "AllergenTypeCode-SHD",
        "AllergenTypeCode-SHEA_NUTS",
        "AllergenTypeCode-SHELLFISH",
        "AllergenTypeCode-SHK",
        "AllergenTypeCode-SHRIMP",
        "AllergenTypeCode-SI",
        "AllergenTypeCode-SJ",
        "AllergenTypeCode-SK",
        "AllergenTypeCode-SL",
        "AllergenTypeCode-SM",
        "AllergenTypeCode-SMELT",
        "AllergenTypeCode-SMF",
        "AllergenTypeCode-SMR",
        "AllergenTypeCode-SMT",
        "AllergenTypeCode-SN",
        "AllergenTypeCode-SNAPPER",
        "AllergenTypeCode-SO",
        "AllergenTypeCode-SOLE",
        "AllergenTypeCode-SOYBEANS",
        "AllergenTypeCode-SP",
        "AllergenTypeCode-SPELT",
        "AllergenTypeCode-SPF",
        "AllergenTypeCode-SQU",
        "AllergenTypeCode-SR",
        "AllergenTypeCode-SS",
        "AllergenTypeCode-ST",
        "AllergenTypeCode-STG",
        "AllergenTypeCode-STURGEON",
        "AllergenTypeCode-SU",
        "AllergenTypeCode-SULPHUR_DIOXIDE",
        "AllergenTypeCode-SUNFLOWER_SEEDS",
        "AllergenTypeCode-SW",
        "AllergenTypeCode-SWORDFISH",
        "AllergenTypeCode-SX",
        "AllergenTypeCode-TA",
        "AllergenTypeCode-TD",
        "AllergenTypeCode-TFD",
        "AllergenTypeCode-TILAPIA",
        "AllergenTypeCode-TR",
        "AllergenTypeCode-TREE_NUTS",
        "AllergenTypeCode-TREE_NUT_TRACES",
        "AllergenTypeCode-TRITICALE",
        "AllergenTypeCode-TROUT",
        "AllergenTypeCode-TTD",
        "AllergenTypeCode-TUNA",
        "AllergenTypeCode-TUR",
        "AllergenTypeCode-TURBOT",
        "AllergenTypeCode-UM",
        "AllergenTypeCode-UN",
        "AllergenTypeCode-UW",
        "AllergenTypeCode-WALLEYE",
        "AllergenTypeCode-WALNUTS",
        "AllergenTypeCode-WFD",
        "AllergenTypeCode-WHEAT",
        "AllergenTypeCode-WHELKS",
        "AllergenTypeCode-WHITEFISH",
        "AllergenTypeCode-WHITING",
        "AllergenTypeCode-WHK",
        "AllergenTypeCode-WHT",
        "AllergenTypeCode-X99",
        "AllergenTypeCode-YMD",
        "Altitude",
        "AmountOfSubstance",
        "AmountOfSubstancePerUnitVolume",
        "AnatomicalFormCode",
        "AnatomicalFormCode-BELLY",
        "AnatomicalFormCode-BLOOD",
        "AnatomicalFormCode-BONE",
        "AnatomicalFormCode-BRAIN",
        "AnatomicalFormCode-CARCASS_NONPOULTRY",
        "AnatomicalFormCode-DIAPHRAM",
        "AnatomicalFormCode-ESOPHAGUS",
        "AnatomicalFormCode-FAT",
        "AnatomicalFormCode-FEET",
        "AnatomicalFormCode-FOREQUARTER",
        "AnatomicalFormCode-GIZZARD",
        "AnatomicalFormCode-HEAD",
        "AnatomicalFormCode-HEADMEAT_CHEEKMEAT",
        "AnatomicalFormCode-HEART",
        "AnatomicalFormCode-HINDQUARTER",
        "AnatomicalFormCode-HORN",
        "AnatomicalFormCode-INTESTINE_LARGE",
        "AnatomicalFormCode-INTESTINE_SMALL",
        "AnatomicalFormCode-KIDNEY",
        "AnatomicalFormCode-LIPS",
        "AnatomicalFormCode-LIVER",
        "AnatomicalFormCode-LUNGS",
        "AnatomicalFormCode-MIXED_OFFAL",
        "AnatomicalFormCode-MIXED_PARTS_FOR_GROUNDING_MINCING",
        "AnatomicalFormCode-NECK",
        "AnatomicalFormCode-PANCREAS",
        "AnatomicalFormCode-SKIN",
        "AnatomicalFormCode-STOMACH",
        "AnatomicalFormCode-TAIL",
        "AnatomicalFormCode-TENDONS",
        "AnatomicalFormCode-TESTICLES",
        "AnatomicalFormCode-THYMUS",
        "AnatomicalFormCode-TONGUE",
        "AnatomicalFormCode-TRIPE",
        "AnatomicalFormCode-UNCLASSIFIED",
        "AnatomicalFormCode-UNIDENTIFIED",
        "AnatomicalFormCode-WHOLE_BIRD",
        "AnatomicalFormCode-WHOLE_MUSCLE_NONPOULTRY_MEATPART_PIECE",
        "AnatomicalFormCode-WHOLE_MUSCLE_POULTRY_PART",
        "AnatomicalFormCode-WHOLE_MUSCLE_PRIMAL",
        "AnatomicalFormCode-WHOLE_MUSCLE_RIBCUT",
        "AnatomicalFormCode-WHOLE_MUSCLE_ROASTCUT",
        "AnatomicalFormCode-WHOLE_MUSCLE_SLICE_CHOPCUT",
        "AnatomicalFormCode-WHOLE_MUSCLE_SLICE_CUTLET",
        "AnatomicalFormCode-WHOLE_MUSCLE_STEAK_CHOPCUT",
        "AnatomicalFormCode-WHOLE_MUSCLE_SUBPRIMAL",
        "Angle",
        "AngularAcceleration",
        "AngularMomentum",
        "AngularVelocity",
        "Area",
        "AuthenticityDetails",
        "AwardPrizeDetails",
        "Beverage",
        "Brand",
        "BusinessEntityType",
        "BusinessEntityType-CORPORATION",
        "BusinessEntityType-FOR_PROFIT",
        "BusinessEntityType-GOVERNMENT_AGENCY",
        "BusinessEntityType-HOLDING_COMPANY",
        "BusinessEntityType-INDIVIDUALLY_OWNED_ENTERPRISE",
        "BusinessEntityType-JOINT_VENTURE",
        "BusinessEntityType-LLC",
        "BusinessEntityType-NOT_FOR_PROFIT",
        "BusinessEntityType-PRIVATE_ENTERPRISE",
        "BusinessEntityType-SOE",
        "Capacitance",
        "CertificationDetails",
        "CertificationStatus",
        "CertificationStatus-ACTIVE",
        "CertificationStatus-INACTIVE",
        "CheeseFirmnessCode",
        "CheeseFirmnessCode-EXTRA_HARD",
        "CheeseFirmnessCode-FIRM_SEMIHARD",
        "CheeseFirmnessCode-HARD",
        "CheeseFirmnessCode-SOFT",
        "CheeseFirmnessCode-UNIDENTIFIED",
        "Clothing",
        "ColourCodeDetails",
        "ColourCodeList-BUYER",
        "ColourCodeList-IFPS",
        "ColourCodeList-NCS",
        "ColourCodeList-NRF",
        "ColourCodeList-PANTONE_HEXACHROME",
        "ColourCodeList-PANTONE_MATCHING",
        "ColourCodeList-PANTONE_PROCESS_COLOUR",
        "ColourCodeList-PANTONE_TEXTILE",
        "ColourCodeList-RAL",
        "ColourCodeList-SELLER",
        "ColourCodeList-WWS",
        "ColourCodeListCode",
        "CompulsoryAdditionalInformation",
        "CompulsoryAdditionalLabelInformationTypeCode",
        "CompulsoryAdditionalLabelInformationTypeCode-CAFFEINE",
        "CompulsoryAdditionalLabelInformationTypeCode-MEAT_POULTRY_WATER_RETENTION",
        "CompulsoryAdditionalLabelInformationTypeCode-PREBIOTIC",
        "CompulsoryAdditionalLabelInformationTypeCode-PROBIOTICS",
        "CompulsoryAdditionalLabelInformationTypeCode-SUPPLEMENTED_FOODS_CAUTION",
        "CompulsoryAdditionalLabelInformationTypeCode-SWEETENERS",
        "Conductance",
        "Conductivity",
        "ConsumerLifestageCode",
        "ConsumerLifestageCode-ADULT",
        "ConsumerLifestageCode-ALL_AGES",
        "ConsumerLifestageCode-BABY_INFANT",
        "ConsumerLifestageCode-CHILD_1_To_2_YEARS",
        "ConsumerLifestageCode-CHILD_2_YEARS_ONWARDS",
        "ConsumerLifestageCode-UNCLASSIFIED",
        "ConsumerLifestageCode-UNIDENTIFIED",
        "ConsumerSalesConditionsCode",
        "ConsumerSalesConditionsCode-BTC",
        "ConsumerSalesConditionsCode-OTC",
        "ConsumerSalesConditionsCode-PRESCRIPTION_REQUIRED",
        "ConsumerSalesConditionsCode-RESTRICTED_TO_SELL_16",
        "ConsumerSalesConditionsCode-RESTRICTED_TO_SELL_18",
        "ConsumerSalesConditionsCode-RESTRICTED_TO_SELL_21",
        "ContactPoint",
        "ContactRoleType",
        "ContactRoleType-ACCOUNTING_CONTACT",
        "ContactRoleType-ACCOUNTS_PAYABLE_CONTACT",
        "ContactRoleType-ACCOUNTS_RECEIVABLE_CONTACT",
        "ContactRoleType-ADMINISTRATIVE_CONTACT",
        "ContactRoleType-AFTER_BUSINESS_HOURS_CONTACT",
        "ContactRoleType-AGENT_CONTACT",
        "ContactRoleType-BANKING_CONTACT",
        "ContactRoleType-CLAIMS_CONTACT",
        "ContactRoleType-CONSUMER_SUPPORT_CONTACT",
        "ContactRoleType-CONTRACT_CONTACT",
        "ContactRoleType-COOK",
        "ContactRoleType-CUSTOMER_RELATIONS",
        "ContactRoleType-CUSTOMER_SUPPORT_CONTACT",
        "ContactRoleType-DANGEROUS_GOODS_CONTACT",
        "ContactRoleType-DELIVERY_CONTACT",
        "ContactRoleType-DEPARTMENT_OR_EMPLOYEE_TO_EXECUTE_EXPORT_PROCEDURES",
        "ContactRoleType-DEPARTMENT_OR_EMPLOYEE_TO_EXECUTE_IMPORT_PROCEDURES",
        "ContactRoleType-DEPARTMENT_OR_PERSON_RESPONSIBLE_FOR_PROCESSING_PURCHASE_ORDER",
        "ContactRoleType-DISTRIBUTOR",
        "ContactRoleType-EMERGENCY_DANGEROUS_GOODS_CONTACT",
        "ContactRoleType-ENGINEERING_CONTACT",
        "ContactRoleType-FINANCIAL_CONTACT",
        "ContactRoleType-GDS_CONTACT",
        "ContactRoleType-GOODS_RECEIVING_CONTACT",
        "ContactRoleType-INFORMATION_CONTACT",
        "ContactRoleType-INSURANCE_CONTACT",
        "ContactRoleType-LICENSEE_REGISTRAR",
        "ContactRoleType-LOGISTICS_CONTACT",
        "ContactRoleType-MANAGER_CONTACT",
        "ContactRoleType-NOTIFICATION_CONTACT",
        "ContactRoleType-OPERATIONS_CONTACT",
        "ContactRoleType-ORDER_CONTACT",
        "ContactRoleType-PACKAGING_ENGINEER_CONTACT",
        "ContactRoleType-PLACE_OF_COLLECTION_CONTACT",
        "ContactRoleType-PRODUCT_MANAGEMENT_CONTACT",
        "ContactRoleType-PRODUCT_RECALL_CONSUMER_CONTACT",
        "ContactRoleType-PRODUCT_RECALL_MEDIA_CONTACT",
        "ContactRoleType-PRODUCT_RECALL_NOTIFICATION_CONTACT",
        "ContactRoleType-PRODUCT_RECALL_REMOVAL_CONTACT",
        "ContactRoleType-PURCHASING_CONTACT",
        "ContactRoleType-QUALITY_COORDINATOR_CONTACT",
        "ContactRoleType-RECALL_SUPPORT_CONTACT",
        "ContactRoleType-RESPONSIBLE_PERSON_FOR_COMPUTER_DATA_PROCESSING",
        "ContactRoleType-RETURN_AUTHORITY_CONTACT",
        "ContactRoleType-SALES_ADMINISTRATION",
        "ContactRoleType-SALES_REPRESENTATIVE_OR_DEPARTMENT_CONTACT",
        "ContactRoleType-SHIPPING_CONTACT",
        "ContactRoleType-TARGET_MARKET_INFORMATION_PROVIDER",
        "ContactRoleType-TECHNICAL_SUPPORT",
        "ContactRoleType-TEST_CONTACT",
        "ContactRoleType-TRAFFIC_ADMINISTRATOR",
        "ContactRoleType-TRANSPORT_CONTACT",
        "ContactRoleType-WARRANTY_CONTACT",
        "Count",
        "Country",
        "Density",
        "DietTypeCode",
        "DietTypeCode-COELIAC",
        "DietTypeCode-DIETETIC",
        "DietTypeCode-FREE_FROM_GLUTEN",
        "DietTypeCode-HALAL",
        "DietTypeCode-KOSHER",
        "DietTypeCode-ORGANIC",
        "DietTypeCode-VEGAN",
        "DietTypeCode-VEGETARIAN",
        "DietTypeCode-WITHOUT_BEEF",
        "DietTypeCode-WITHOUT_PORK",
        "DietTypeCodeDetails",
        "Dimensionless",
        "Discount",
        "DiscountTypeCode",
        "DiscountTypeCode-BOGO",
        "DiscountTypeCode-DISCOUNTED_ITEM",
        "DiscountTypeCode-FREE_GIFT",
        "DiscountTypeCode-FREE_SHIPPING",
        "DiscountTypeCode-OTHER",
        "DiscountTypeCode-PERCENTAGE_OFF",
        "DoseEquivalent",
        "DoseEquivalentRate",
        "DynamicViscosity",
        "ERROR_CONDITION",
        "ElectricCharge",
        "ElectricCurrent",
        "ElectricCurrentDensity",
        "ElectricFieldStrength",
        "Energy",
        "Exposure",
        "FoodAndBeveragePreparationInformation",
        "FoodBeverageRefrigerationClaimCode",
        "FoodBeverageRefrigerationClaimCode-CAN_BE_REFRIGERATED",
        "FoodBeverageRefrigerationClaimCode-MUST_BE_REFRIGERATED",
        "FoodBeverageRefrigerationClaimCode-SHELF_STABLE",
        "FoodBeverageRefrigerationClaimCode-UNIDENTIFIED",
        "FoodBeverageTargetUseCode",
        "FoodBeverageTargetUseCode-ANY_MEAL",
        "FoodBeverageTargetUseCode-BREAKFAST",
        "FoodBeverageTargetUseCode-MAIN_MEAL",
        "FoodBeverageTargetUseCode-PORTABLE_MEAL",
        "FoodBeverageTargetUseCode-SNACK",
        "FoodBeverageTargetUseCode-UNCLASSIFIED",
        "FoodBeverageTobaccoIngredientDetails",
        "FoodBeverageTobaccoProduct",
        "Footwear",
        "FootwearFasteningTypeCode",
        "FootwearFasteningTypeCode-MULTIPLE_FASTENING",
        "FootwearFasteningTypeCode-SHOE_LACE",
        "FootwearFasteningTypeCode-SLIP_ON_WITHOUT_ELASTIC",
        "FootwearFasteningTypeCode-SLIP_ON_WITH_ELASTIC",
        "FootwearFasteningTypeCode-STRAP",
        "FootwearFasteningTypeCode-UNCLASSIFIED",
        "FootwearFasteningTypeCode-UNIDENTIFIED",
        "FootwearFasteningTypeCode-VELCRO",
        "Force",
        "Frequency",
        "FreshOrSeawaterFarmedCode",
        "FreshOrSeawaterFarmedCode-FRESHWATER_FARMED",
        "FreshOrSeawaterFarmedCode-SEAWATER_FARMED",
        "FreshOrSeawaterFarmedCode-UNCLASSIFIED",
        "FreshOrSeawaterFarmedCode-UNIDENTIFIED",
        "FruitsVegetables",
        "GLN_TypeCode",
        "GLN_TypeCode-DIGITAL_LOCATION",
        "GLN_TypeCode-FIXED_PHYSICAL_LOCATION",
        "GLN_TypeCode-FUNCTION",
        "GLN_TypeCode-LEGAL_ENTITY",
        "GLN_TypeCode-MOBILE_PHYSICAL_LOCATION",
        "GeoCoordinates",
        "GeoShape",
        "GrowingMethodCode",
        "GrowingMethodCode-CAGE_FREE",
        "GrowingMethodCode-CLONED_FOODS",
        "GrowingMethodCode-CONVENTIONAL",
        "GrowingMethodCode-FARM_RAISED",
        "GrowingMethodCode-FIELD_GROWN",
        "GrowingMethodCode-FLY_FREE",
        "GrowingMethodCode-FREE_RANGE",
        "GrowingMethodCode-GRASS_FED",
        "GrowingMethodCode-GREENHOUSE",
        "GrowingMethodCode-HUMANELY_RAISED",
        "GrowingMethodCode-HYDROPONIC",
        "GrowingMethodCode-INTEGRATED_PEST_MANAGEMENT",
        "GrowingMethodCode-ORGANIC",
        "GrowingMethodCode-SHADE_GROWN",
        "GrowingMethodCode-SUSTAINABLE",
        "GrowingMethodCode-WILD",
        "Illuminance",
        "Inductance",
        "Irradiance",
        "KinematicViscosity",
        "Length",
        "LevelOfContainmentCode",
        "LevelOfContainmentCode-CONTAINS",
        "LevelOfContainmentCode-FREE_FROM",
        "LevelOfContainmentCode-MAY_CONTAIN",
        "LinearMomentum",
        "LocationID_Details",
        "LocationID_Type",
        "LocationID_Type-BE_KBO_NUMBER",
        "LocationID_Type-BIC_FACILITY",
        "LocationID_Type-CRD_LOCATION_CODE",
        "LocationID_Type-ENI_NUMBER",
        "LocationID_Type-FR_SIRET",
        "LocationID_Type-IATA_CODE",
        "LocationID_Type-IMO_NUMBER",
        "LocationID_Type-ISPS_CODE",
        "LocationID_Type-ISRS_LOCATION_CODE",
        "LocationID_Type-LOCATION_FOR_INTERNAL_USE_1",
        "LocationID_Type-LOCATION_FOR_INTERNAL_USE_10",
        "LocationID_Type-LOCATION_FOR_INTERNAL_USE_2",
        "LocationID_Type-LOCATION_FOR_INTERNAL_USE_3",
        "LocationID_Type-LOCATION_FOR_INTERNAL_USE_4",
        "LocationID_Type-LOCATION_FOR_INTERNAL_USE_5",
        "LocationID_Type-LOCATION_FOR_INTERNAL_USE_6",
        "LocationID_Type-LOCATION_FOR_INTERNAL_USE_7",
        "LocationID_Type-LOCATION_FOR_INTERNAL_USE_8",
        "LocationID_Type-LOCATION_FOR_INTERNAL_USE_9",
        "LocationID_Type-MMSI_NUMBER",
        "LocationID_Type-NL_KVK_ESTABLISHMENT_UNIT_NUMBER",
        "LocationID_Type-OAR_ID",
        "LocationID_Type-OPEN_LOCATION_CODE",
        "LocationID_Type-OS_ID",
        "LocationID_Type-SE_CFAR_NUMBER",
        "LocationID_Type-SMDG_CODE",
        "LocationID_Type-UN_LOCODE",
        "LocationID_Type-US_CIF_CODE",
        "LocationID_Type-US_EST_NUMBER",
        "LocationID_Type-US_FEI",
        "LocationID_Type-US_HIN_IDENTIFICATION",
        "LocationID_Type-US_MINE_ID",
        "LocationID_Type-US_TCN_CODE",
        "LocationRoleType",
        "LocationRoleType-AGED_CARE_SERVICE",
        "LocationRoleType-AIRCRAFT",
        "LocationRoleType-AIRPORT",
        "LocationRoleType-AIRPORT_GATE",
        "LocationRoleType-AMBIENT_STORAGE",
        "LocationRoleType-AMBULANCE_SERVICE",
        "LocationRoleType-AMUSEMENT_ENTERTAINMENT_GAMING",
        "LocationRoleType-ASSEMBLY",
        "LocationRoleType-ATM",
        "LocationRoleType-BACKROOM",
        "LocationRoleType-BANK",
        "LocationRoleType-BERTH",
        "LocationRoleType-BIRTH_AREA",
        "LocationRoleType-BOAT",
        "LocationRoleType-BOTTLING_SITE",
        "LocationRoleType-BOX_CRUSHER",
        "LocationRoleType-BRANCH_LOCATION",
        "LocationRoleType-CASH_CARRY_STORE",
        "LocationRoleType-CITY_CENTER_SHOP",
        "LocationRoleType-CLINIC",
        "LocationRoleType-CLINICAL_TRIAL_SITE",
        "LocationRoleType-COLLECTION_CENTER",
        "LocationRoleType-CONSOLIDATING_CENTER",
        "LocationRoleType-CONSTRUCTION_SITE",
        "LocationRoleType-CONTAINER_DECK",
        "LocationRoleType-CONTROLLED_SUBSTANCE_AREA",
        "LocationRoleType-CONVENIENCE_STORE",
        "LocationRoleType-CONVEYOR_BELT",
        "LocationRoleType-CORRECTION_FACILITY",
        "LocationRoleType-CUSTOMER_PICK-UP_AREA",
        "LocationRoleType-CUSTOMS_BORDER_CONTROL",
        "LocationRoleType-DENTAL_HEALTH_SERVICE",
        "LocationRoleType-DEPOT",
        "LocationRoleType-DISPENSER",
        "LocationRoleType-DISTRIBUTION_CENTER",
        "LocationRoleType-DOCK",
        "LocationRoleType-DOCTOR_OFFICE",
        "LocationRoleType-DRUG_STORE",
        "LocationRoleType-DUTY_FREE_STORE",
        "LocationRoleType-EARLY_CHILDHOOD_EDUCATING_AND_CENTER",
        "LocationRoleType-EDI_STATION",
        "LocationRoleType-EDUCATION_FACILITY",
        "LocationRoleType-ELECTRONICS_AREA",
        "LocationRoleType-EMERGENCY_DEPARTMENT_AREA",
        "LocationRoleType-END_CAP_AREA",
        "LocationRoleType-ENTRANCE_GATE",
        "LocationRoleType-EXIT_GATE",
        "LocationRoleType-FARM",
        "LocationRoleType-FEEDLOT_SITE",
        "LocationRoleType-FIELD",
        "LocationRoleType-FIXED_READER",
        "LocationRoleType-FIXED_TRANSPORT_FACILITIES",
        "LocationRoleType-FOOD_BUSINESS",
        "LocationRoleType-FREIGHT_HUB",
        "LocationRoleType-FREIGHT_TERMINAL",
        "LocationRoleType-GARDEN_CENTER",
        "LocationRoleType-GATE",
        "LocationRoleType-GENERAL_MDSE_AREA",
        "LocationRoleType-GOVERNMENT_DEPARTMENT_AGENCY",
        "LocationRoleType-GREENHOUSE",
        "LocationRoleType-GROCERY",
        "LocationRoleType-HANDLING_AREA",
        "LocationRoleType-HEAD_OFFICE",
        "LocationRoleType-HOSPITAL",
        "LocationRoleType-HOSPITAL_CAFETERIA",
        "LocationRoleType-HOSPITAL_DEPARTMENT",
        "LocationRoleType-HOSPITAL_PHARMACY",
        "LocationRoleType-IMAGING_DIAGNOSTICS_AREA",
        "LocationRoleType-IMPREST_LOCATION",
        "LocationRoleType-INLAND_FISHERY",
        "LocationRoleType-INLAND_PORT",
        "LocationRoleType-INTERMODAL_TERMINAL",
        "LocationRoleType-INTERNATIONAL_MAIL_PROCESSING_CENTER",
        "LocationRoleType-LANE_OR_ROUTE",
        "LocationRoleType-LAY-AWAY",
        "LocationRoleType-LIBRARY",
        "LocationRoleType-MAIN_RECEPTION",
        "LocationRoleType-MANUFACTURING_PLANT",
        "LocationRoleType-MARINE_FISHERY",
        "LocationRoleType-MARKET",
        "LocationRoleType-MENTAL_HEALTH_SERVICE",
        "LocationRoleType-MILKING_SITE",
        "LocationRoleType-MOBILE_READER",
        "LocationRoleType-NURSE_STATION",
        "LocationRoleType-OFFICE",
        "LocationRoleType-ONLINE_PLATFORM",
        "LocationRoleType-ONLINE_SHOP",
        "LocationRoleType-OPERATING_THEATER",
        "LocationRoleType-PACKAGING_AREA",
        "LocationRoleType-PACKHOUSE",
        "LocationRoleType-PALLET_WRAPPER",
        "LocationRoleType-PATHOLOGY",
        "LocationRoleType-PERSONAL_SERVICES",
        "LocationRoleType-PETROL_STATION",
        "LocationRoleType-PICK-UP_LOCATION",
        "LocationRoleType-PICKING_AREA",
        "LocationRoleType-POINT_OF_SALE",
        "LocationRoleType-PRIMARY_HEALTH_SERVICE",
        "LocationRoleType-PRINTING_ROOM",
        "LocationRoleType-PRODUCTION_AREA",
        "LocationRoleType-PRODUCTION_LINE",
        "LocationRoleType-PROMOTION_AREA",
        "LocationRoleType-PUBLIC_WAREHOUSE",
        "LocationRoleType-QUALITY_CONTROL",
        "LocationRoleType-QUARANTINE",
        "LocationRoleType-RAIL_STATION",
        "LocationRoleType-RAIL_TERMINAL",
        "LocationRoleType-READ_POINT_VERIFICATION_SPOT",
        "LocationRoleType-REARING_AREA",
        "LocationRoleType-RECALLED_PRODUCT_AREA",
        "LocationRoleType-RECEIVING_AREA",
        "LocationRoleType-RECEIVING_LOCATION",
        "LocationRoleType-REPACKING_FACILITY",
        "LocationRoleType-RESEARCH_FACILITY",
        "LocationRoleType-RESIDENCE",
        "LocationRoleType-RETAIL_PHARMACY",
        "LocationRoleType-RETURNABLE_ASSET_SERVICE_CENTER",
        "LocationRoleType-RETURNS_AREA",
        "LocationRoleType-ROAD_TERMINAL",
        "LocationRoleType-SALES_FLOOR",
        "LocationRoleType-SALES_FLOOR_TRANSITION_AREA",
        "LocationRoleType-SALES_YARD",
        "LocationRoleType-SEAPORT",
        "LocationRoleType-SECURITY_AREA",
        "LocationRoleType-SELF_SERVICE",
        "LocationRoleType-SERVICE_COUNTER",
        "LocationRoleType-SHELF",
        "LocationRoleType-SHIPPING_AREA",
        "LocationRoleType-SHIP_FROM_LOCATION",
        "LocationRoleType-SHIP_TO_LOCATION",
        "LocationRoleType-SILO",
        "LocationRoleType-SLAUGHTER_HOUSE",
        "LocationRoleType-SPORTS_AND_RECERATIONAL",
        "LocationRoleType-STAGING_AREA",
        "LocationRoleType-STATION",
        "LocationRoleType-STORAGE_AREA",
        "LocationRoleType-STORE",
        "LocationRoleType-TERMINAL",
        "LocationRoleType-TRADE_ITEM_RETURN_LOCATION",
        "LocationRoleType-TRAIN",
        "LocationRoleType-VENDING",
        "LocationRoleType-VENDOR_LEASED_SPACE",
        "LocationRoleType-VINEYARD",
        "LocationRoleType-VISITING_ADDRESS",
        "LocationRoleType-WARD",
        "LocationRoleType-WAREHOUSE",
        "LocationRoleType-WASTE_CENTER",
        "LocationRoleType-WHARF",
        "LocationRoleType-YARD",
        "LocationStatusHistory",
        "Luminance",
        "LuminousFlux",
        "LuminousIntensity",
        "MagneticFlux",
        "MagneticFluxDensity",
        "MagneticVectorPotential",
        "Mass",
        "MassConcentration",
        "MassFlowRate",
        "MassPerAreaTime",
        "MaturationMethodCode",
        "MaturationMethodCode-JET_FRESH",
        "MaturationMethodCode-PRECONDITIONED",
        "MaturationMethodCode-TREE_VINE_RIPE",
        "MeasurementPrecisionCode",
        "MeasurementPrecisionCode-APPROXIMATELY",
        "MeasurementPrecisionCode-EXACT",
        "MeasurementPrecisionCode-LESS_THAN",
        "MeasurementType",
        "MeatPoultry",
        "MemoryCapacity",
        "Message",
        "MilkButterCreamYogurtCheeseEggsSubstitutes",
        "MolalityOfSolute",
        "MolarEnergy",
        "MolarMass",
        "MolarVolume",
        "NonbinaryLogicCode",
        "NonbinaryLogicCode-FALSE",
        "NonbinaryLogicCode-NOT_APPLICABLE",
        "NonbinaryLogicCode-TRUE",
        "NonbinaryLogicCode-UNSPECIFIED",
        "NutrientBasisQuantityCode",
        "NutrientBasisQuantityCode-BY_MEASURE",
        "NutrientBasisQuantityCode-BY_SERVING",
        "NutritionMeasurementType",
        "NutritionalClaimTypeCode",
        "NutritionalClaimTypeCode-ADDITIVE_FREE",
        "NutritionalClaimTypeCode-ARTIFICIALLY_SWEETENED",
        "NutritionalClaimTypeCode-CHOLESTEROL_FREE",
        "NutritionalClaimTypeCode-COLOURING_AGENT_FREE",
        "NutritionalClaimTypeCode-CONTAINS_GLYZYRRHIZIN",
        "NutritionalClaimTypeCode-CONTAINS_LIQUORICE",
        "NutritionalClaimTypeCode-CONTAINS_SOY",
        "NutritionalClaimTypeCode-EGG_FREE",
        "NutritionalClaimTypeCode-ENERGY_FREE",
        "NutritionalClaimTypeCode-ENERGY_REDUCED",
        "NutritionalClaimTypeCode-ENRICHED_OR_FORTIFIED_IN_VITAMINS_AND_OR_MINERALS",
        "NutritionalClaimTypeCode-FAT_FREE",
        "NutritionalClaimTypeCode-FREE_FROM_GLUTEN",
        "NutritionalClaimTypeCode-GUARANTEED_LACTOSE_FREE",
        "NutritionalClaimTypeCode-HIGH_FIBRE",
        "NutritionalClaimTypeCode-HIGH_PROTEIN",
        "NutritionalClaimTypeCode-HIGH_VITAMINS_AND_OR_MINERALS",
        "NutritionalClaimTypeCode-LACTOSE_FREE",
        "NutritionalClaimTypeCode-LIGHT_LITE",
        "NutritionalClaimTypeCode-LOW_ENERGY",
        "NutritionalClaimTypeCode-LOW_FAT",
        "NutritionalClaimTypeCode-LOW_LACTOSE",
        "NutritionalClaimTypeCode-LOW_PROTEIN",
        "NutritionalClaimTypeCode-LOW_SATURATED_FAT",
        "NutritionalClaimTypeCode-LOW_SODIUM_SALT",
        "NutritionalClaimTypeCode-LOW_SUGARS",
        "NutritionalClaimTypeCode-MILK_FREE",
        "NutritionalClaimTypeCode-MILK_PROTEIN_FREE",
        "NutritionalClaimTypeCode-NATURAL_SOURCE_OF_VITAMINS_AND_OR_MINERALS",
        "NutritionalClaimTypeCode-NON_ALCOHOLIC",
        "NutritionalClaimTypeCode-NUT_FREE",
        "NutritionalClaimTypeCode-PEANUT_FREE",
        "NutritionalClaimTypeCode-PRESERVATIVE_FREE",
        "NutritionalClaimTypeCode-SATURATED_FAT_FREE",
        "NutritionalClaimTypeCode-SODIUM_FREE_OR_SALT_FREE",
        "NutritionalClaimTypeCode-SOURCE_OF_FIBRE",
        "NutritionalClaimTypeCode-SOURCE_OF_PROTEIN",
        "NutritionalClaimTypeCode-SOY_FREE",
        "NutritionalClaimTypeCode-STRONGLY_SALTED",
        "NutritionalClaimTypeCode-SUGARS_FREE",
        "NutritionalClaimTypeCode-SWEETENED_WITH_AGAVE_SYRUP",
        "NutritionalClaimTypeCode-SWEETENED_WITH_CANE_SUGAR",
        "NutritionalClaimTypeCode-SWEETENED_WITH_CORN_SYRUP",
        "NutritionalClaimTypeCode-SWEETENED_WITH_FRUCTOSE",
        "NutritionalClaimTypeCode-SWEETENED_WITH_FRUIT_JUICE",
        "NutritionalClaimTypeCode-SWEETENED_WITH_FRUIT_SYRUP",
        "NutritionalClaimTypeCode-SWEETENED_WITH_HONEY",
        "NutritionalClaimTypeCode-SWEETENED_WITH_MALT",
        "NutritionalClaimTypeCode-SWEETENED_WITH_RAW_BEET_SUGAR",
        "NutritionalClaimTypeCode-SWEETENED_WITH_WHITE_SUGAR",
        "NutritionalClaimTypeCode-VERY_LOW_GLUTEN",
        "NutritionalClaimTypeCode-VERY_LOW_SODIUM_SALT",
        "NutritionalClaimTypeCode-WHEAT_FREE",
        "NutritionalClaimTypeCode-WITH_NO_ADDED_SUGARS",
        "Offer",
        "OfferRedemptionTypeCode",
        "OfferRedemptionTypeCode-COUPON_CODE",
        "OfferRedemptionTypeCode-GIFT_CARD",
        "OfferRedemptionTypeCode-REBATE",
        "OfferRedemptionTypeCode-SALE",
        "OfferRedemptionTypeCode-SINGLE_USE_CODE",
        "OrganicClaimAgencyCode",
        "OrganicClaimAgencyCode-1",
        "OrganicClaimAgencyCode-10",
        "OrganicClaimAgencyCode-11",
        "OrganicClaimAgencyCode-12",
        "OrganicClaimAgencyCode-13",
        "OrganicClaimAgencyCode-14",
        "OrganicClaimAgencyCode-15",
        "OrganicClaimAgencyCode-16",
        "OrganicClaimAgencyCode-17",
        "OrganicClaimAgencyCode-19",
        "OrganicClaimAgencyCode-2",
        "OrganicClaimAgencyCode-20",
        "OrganicClaimAgencyCode-21",
        "OrganicClaimAgencyCode-22",
        "OrganicClaimAgencyCode-23",
        "OrganicClaimAgencyCode-24",
        "OrganicClaimAgencyCode-25",
        "OrganicClaimAgencyCode-26",
        "OrganicClaimAgencyCode-27",
        "OrganicClaimAgencyCode-28",
        "OrganicClaimAgencyCode-29",
        "OrganicClaimAgencyCode-3",
        "OrganicClaimAgencyCode-30",
        "OrganicClaimAgencyCode-31",
        "OrganicClaimAgencyCode-32",
        "OrganicClaimAgencyCode-33",
        "OrganicClaimAgencyCode-34",
        "OrganicClaimAgencyCode-4",
        "OrganicClaimAgencyCode-5",
        "OrganicClaimAgencyCode-6",
        "OrganicClaimAgencyCode-7",
        "OrganicClaimAgencyCode-8",
        "OrganicClaimAgencyCode-9",
        "OrganicClaimAgencyCode-999",
        "OrganicClaimAgencyCode-BFA",
        "OrganicClaimAgencyCode-BIOLAND",
        "OrganicClaimAgencyCode-DEMETER_BUND",
        "OrganicClaimAgencyCode-DEMETER_INTERNATIONAL",
        "OrganicClaimAgencyCode-ECOLAND",
        "OrganicClaimAgencyCode-ECOVIN",
        "OrganicClaimAgencyCode-EPA",
        "OrganicClaimAgencyCode-FDA",
        "OrganicClaimAgencyCode-FSA",
        "OrganicClaimAgencyCode-GAA",
        "OrganicClaimAgencyCode-IFOA",
        "OrganicClaimAgencyCode-IFOAM",
        "OrganicClaimAgencyCode-NATURLAND",
        "OrganicClaimAgencyCode-QAI",
        "OrganicClaimAgencyCode-SUDITIROL",
        "OrganicClaimAgencyCode-USDA",
        "OrganicClaimDetails",
        "Organization",
        "OrganizationClassificationDetails",
        "OrganizationClassificationType",
        "OrganizationClassificationType-GICS",
        "OrganizationClassificationType-ICB",
        "OrganizationClassificationType-ISIC",
        "OrganizationClassificationType-NACE",
        "OrganizationClassificationType-NAICS",
        "OrganizationClassificationType-SIC",
        "OrganizationID_Details",
        "OrganizationID_Type",
        "OrganizationID_Type-AU_ABN",
        "OrganizationID_Type-AU_ACN",
        "OrganizationID_Type-CRD_PARTNER_CODE",
        "OrganizationID_Type-CRN",
        "OrganizationID_Type-DID",
        "OrganizationID_Type-DUNS",
        "OrganizationID_Type-DUNS_PLUS_FOUR",
        "OrganizationID_Type-EORI",
        "OrganizationID_Type-EO_ID",
        "OrganizationID_Type-EU_VAT_IDENTIFICATION_NUMBER",
        "OrganizationID_Type-FR_RCS",
        "OrganizationID_Type-FR_SIREN",
        "OrganizationID_Type-IMO_COMPANY_NUMBER",
        "OrganizationID_Type-LEI",
        "OrganizationID_Type-NL_KVK_NUMBER",
        "OrganizationID_Type-NL_OIN_NUMBER",
        "OrganizationID_Type-NZ_GST_NUMBER",
        "OrganizationID_Type-NZ_IRD_NUMBER",
        "OrganizationID_Type-ORG_FOR_INTERNAL_USE_1",
        "OrganizationID_Type-ORG_FOR_INTERNAL_USE_10",
        "OrganizationID_Type-ORG_FOR_INTERNAL_USE_2",
        "OrganizationID_Type-ORG_FOR_INTERNAL_USE_3",
        "OrganizationID_Type-ORG_FOR_INTERNAL_USE_4",
        "OrganizationID_Type-ORG_FOR_INTERNAL_USE_5",
        "OrganizationID_Type-ORG_FOR_INTERNAL_USE_6",
        "OrganizationID_Type-ORG_FOR_INTERNAL_USE_7",
        "OrganizationID_Type-ORG_FOR_INTERNAL_USE_8",
        "OrganizationID_Type-ORG_FOR_INTERNAL_USE_9",
        "OrganizationID_Type-PHYTOSANITARY_REGISTRATION_NUMBER",
        "OrganizationID_Type-TIN",
        "OrganizationID_Type-UK_CRN",
        "OrganizationID_Type-US_498_ID",
        "OrganizationID_Type-US_499_FILER_ID",
        "OrganizationID_Type-US_BEA_ID",
        "OrganizationID_Type-US_CAGE",
        "OrganizationID_Type-US_CID",
        "OrganizationID_Type-US_CRD",
        "OrganizationID_Type-US_DEA",
        "OrganizationID_Type-US_DODAAC",
        "OrganizationID_Type-US_EIN",
        "OrganizationID_Type-US_EPA_ID",
        "OrganizationID_Type-US_FCC_FRN",
        "OrganizationID_Type-US_FDIC",
        "OrganizationID_Type-US_FHFA_ID",
        "OrganizationID_Type-US_FMC_ID",
        "OrganizationID_Type-US_GIIN",
        "OrganizationID_Type-US_LAB_ID",
        "OrganizationID_Type-US_LIC",
        "OrganizationID_Type-US_MFG_ID",
        "OrganizationID_Type-US_MIC",
        "OrganizationID_Type-US_NPI",
        "OrganizationID_Type-US_RN",
        "OrganizationID_Type-US_RSSD_ID",
        "OrganizationID_Type-US_SCAC",
        "OrganizationID_Type-US_UEI",
        "OrganizationRoleType",
        "OrganizationRoleType-ACCEPTING_PARTY",
        "OrganizationRoleType-ACCOUNTS_DEPARTMENT",
        "OrganizationRoleType-AGRICULTURAL_COOPERATIVE",
        "OrganizationRoleType-AIRPORT_OPERATOR",
        "OrganizationRoleType-AREA_HEALTH_SERVICE",
        "OrganizationRoleType-ARRIVING_GOODS_PARTY",
        "OrganizationRoleType-BILL_OF_LADING_RECIPIENT",
        "OrganizationRoleType-BILL_TO",
        "OrganizationRoleType-BRANCH",
        "OrganizationRoleType-BRAND_OWNER",
        "OrganizationRoleType-BREEDER",
        "OrganizationRoleType-BROKER_AGENT",
        "OrganizationRoleType-BUYER",
        "OrganizationRoleType-BUYERS_AGENT_REPRESENTATIVE",
        "OrganizationRoleType-BUYING_DEPARTMENT",
        "OrganizationRoleType-CARRIER",
        "OrganizationRoleType-CENTRAL_PAYMENT_SERVICE",
        "OrganizationRoleType-CHECKING_PARTY",
        "OrganizationRoleType-CHECK_ORDER",
        "OrganizationRoleType-CLINICAL_TRIAL_SPONSOR",
        "OrganizationRoleType-COMPLIANCE_AUTHORITY_OR_AGENCY",
        "OrganizationRoleType-CONFORMITY_ASSESSMENT_BODY",
        "OrganizationRoleType-CONSIGNEE",
        "OrganizationRoleType-CONSIGNOR",
        "OrganizationRoleType-CONSOLIDATOR",
        "OrganizationRoleType-CONSUMER",
        "OrganizationRoleType-CORPORATE_IDENTITY",
        "OrganizationRoleType-COUNTRY_ORGANIZATION",
        "OrganizationRoleType-CUSTOMS",
        "OrganizationRoleType-CUSTOMS_AUTHORITY",
        "OrganizationRoleType-CUSTOMS_BROKER",
        "OrganizationRoleType-CUTTER",
        "OrganizationRoleType-DATA_CONSUMER",
        "OrganizationRoleType-DATA_PROVIDER",
        "OrganizationRoleType-DECLARANTS_AGENT_REPRESENTATIVE",
        "OrganizationRoleType-DELIVERY_PARTY",
        "OrganizationRoleType-DELIVERY_RECIPIENT_PARTY",
        "OrganizationRoleType-DESIGNER",
        "OrganizationRoleType-DESPATCH_PARTY",
        "OrganizationRoleType-DISPATCH_PARTY",
        "OrganizationRoleType-DISTRIBUTION_MANAGEMENT_ENTITY_PROVIDER",
        "OrganizationRoleType-DISTRIBUTOR",
        "OrganizationRoleType-DOCK_DOOR",
        "OrganizationRoleType-EMERGENCY_DEPARTMENT",
        "OrganizationRoleType-EMPTY_EQUIPMENT_DISPATCH_PARTY",
        "OrganizationRoleType-EMPTY_EQUIPMENT_RETURN_PARTY",
        "OrganizationRoleType-EQUIPMENT_OWNER",
        "OrganizationRoleType-EXPORTER",
        "OrganizationRoleType-E_TAILER",
        "OrganizationRoleType-FACILITIES_MAINTENANCE_DEPARTMENT",
        "OrganizationRoleType-FACTOR",
        "OrganizationRoleType-FARM_OPERATOR",
        "OrganizationRoleType-FATTENER",
        "OrganizationRoleType-FISHING_OPERATOR",
        "OrganizationRoleType-FOODSERVICE_DISTRIBUTOR",
        "OrganizationRoleType-FOODSERVICE_OPERATOR",
        "OrganizationRoleType-FREIGHT_FORWARDER",
        "OrganizationRoleType-GOODS_OWNER",
        "OrganizationRoleType-GOVERNMENT_AGENCY",
        "OrganizationRoleType-GOVERNMENT_DEPARTMENT_OR_MINISTRY",
        "OrganizationRoleType-GROWER",
        "OrganizationRoleType-HARVESTER",
        "OrganizationRoleType-HEALTHCARE_PROVIDER",
        "OrganizationRoleType-HOSPITAL_ORGANIZATION",
        "OrganizationRoleType-HOSPITAL_PHARMACY_OPERATOR",
        "OrganizationRoleType-IMPORTER",
        "OrganizationRoleType-INFORMATION_PROVIDER",
        "OrganizationRoleType-INSURER",
        "OrganizationRoleType-INTERMEDIARY_BANK",
        "OrganizationRoleType-INTERMEDIARY_BANK_1",
        "OrganizationRoleType-INTERMEDIARY_BANK_2",
        "OrganizationRoleType-INVENTORY_CONTROLLER",
        "OrganizationRoleType-INVENTORY_REPORTING_PARTY",
        "OrganizationRoleType-INVOICEE",
        "OrganizationRoleType-ISSUER_OF_INVOICE",
        "OrganizationRoleType-LOGISTICS_SERVICE_PROVIDER",
        "OrganizationRoleType-MANUFACTURER_OF_FINISHED_GOODS",
        "OrganizationRoleType-MANUFACTURER_OF_GOODS",
        "OrganizationRoleType-MANUFACTURER_OF_UNFINISHED_GOODS",
        "OrganizationRoleType-MARKETING_DEPARTMENT",
        "OrganizationRoleType-MARKETPLACE_OPERATOR",
        "OrganizationRoleType-MARK_FOR",
        "OrganizationRoleType-MENTAL_HEALTH_SERVICE",
        "OrganizationRoleType-MESSAGE_FROM",
        "OrganizationRoleType-MESSAGE_RECIPIENT",
        "OrganizationRoleType-MINCER",
        "OrganizationRoleType-OPERATING_DIVISION",
        "OrganizationRoleType-OPERATOR",
        "OrganizationRoleType-ORDERING_PARTY",
        "OrganizationRoleType-OWNER_OF_EQUIPMENT",
        "OrganizationRoleType-OWNER_OF_MEANS_OF_TRANSPORT",
        "OrganizationRoleType-PACKER",
        "OrganizationRoleType-PARTY_DECLARING_THE_VALUE_ADDED_TAX",
        "OrganizationRoleType-PARTY_FOR_WHOM_ITEM_IS_ULTIMATELY_INTENDED",
        "OrganizationRoleType-PARTY_RECEIVING_PRIVATE_DATA",
        "OrganizationRoleType-PARTY_RECOVERING_THE_VALUE_ADDED_TAX",
        "OrganizationRoleType-PARTY_TO_RECEIVE_ALL_DOCUMENTS",
        "OrganizationRoleType-PARTY_TO_RECEIVE_COMMERCIAL_INVOICE",
        "OrganizationRoleType-PARTY_TO_RECEIVE_ELECTRONIC_MEMO_OF_INVOICE",
        "OrganizationRoleType-PARTY_TO_RECEIVE_FREIGHT_BILL",
        "OrganizationRoleType-PARTY_TO_RECEIVE_REFUND",
        "OrganizationRoleType-PAYEE",
        "OrganizationRoleType-PAYER",
        "OrganizationRoleType-PHARMACY_OPERATOR",
        "OrganizationRoleType-PORT_OPERATOR",
        "OrganizationRoleType-PRICE_LOCATION_PARTY",
        "OrganizationRoleType-PROXY",
        "OrganizationRoleType-PURCHASE_ORDER_RECEIVER",
        "OrganizationRoleType-RECALL_RECIPIENT",
        "OrganizationRoleType-RECALL_SPONSOR",
        "OrganizationRoleType-REGIONAL_ORGANIZATION",
        "OrganizationRoleType-REGISTERED_AGENT",
        "OrganizationRoleType-REMIT_TO",
        "OrganizationRoleType-REPACKER",
        "OrganizationRoleType-RETAILER",
        "OrganizationRoleType-RETAIL_PHARMACY_OPERATOR",
        "OrganizationRoleType-SALES_DEPARTMENT",
        "OrganizationRoleType-SELLER",
        "OrganizationRoleType-SERVICE_PROVIDER",
        "OrganizationRoleType-SHIPPER",
        "OrganizationRoleType-SHIP_FROM",
        "OrganizationRoleType-SHIP_FROM_PARTY",
        "OrganizationRoleType-SHIP_TO",
        "OrganizationRoleType-SHIP_TO_PARTY",
        "OrganizationRoleType-SLAUGHTERER",
        "OrganizationRoleType-STORAGE_AND_HANDLING",
        "OrganizationRoleType-STORAGE_AND_HANDLING_PARTY",
        "OrganizationRoleType-SUBSTITUTE_SUPPLIER",
        "OrganizationRoleType-SUPPLIER",
        "OrganizationRoleType-SUPPLY_CHAIN",
        "OrganizationRoleType-TECHNICAL_SUPPORT_DEPARTMENT",
        "OrganizationRoleType-TRADER",
        "OrganizationRoleType-TRADER_FINANCIAL",
        "OrganizationRoleType-TRADER_GOODS",
        "OrganizationRoleType-TRANSPORTATION_CARRIER",
        "OrganizationRoleType-WAREHOUSE_KEEPER",
        "OrganizationRoleType-WHOLESALER",
        "OrganizationStatusHistory",
        "PackagingDetails",
        "PackagingFeatureCode",
        "PackagingFeatureCode-BASE",
        "PackagingFeatureCode-BEAM",
        "PackagingFeatureCode-BUNG_SEAL",
        "PackagingFeatureCode-CAP",
        "PackagingFeatureCode-CARRIER",
        "PackagingFeatureCode-CONSUMPTION_UTENSIL",
        "PackagingFeatureCode-CORE",
        "PackagingFeatureCode-CREEL",
        "PackagingFeatureCode-EDGE_PROTECTION",
        "PackagingFeatureCode-HANDLE",
        "PackagingFeatureCode-INNER_CONTAINER",
